w20d2_homework/tweeter_app_api/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
    def index
        render json: { status: 200, tweets: Tweet.all }

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        found_tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("title", "content", "author") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Substitute"], ["content", "Pre-sent"], ["author", "Tim-othy"]]
---
    def create
        tweet = Tweet.new(tweet_params)

        if tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tweets" SET "title" = $1, "content" = $2, "author" = $3 WHERE "tweets"."id" = $4  [["title", "De-nice"], ["content", "Do you mean Denise?"], ["author", "Denise"], ["id", 3]]
---
    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)

DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 3]]
---
    def destroy
        tweet = Tweet.destroy(params[:id])